# Rebar Bend Data Termination Rotation Angle 1 Property

Source: https://www.revitapidocs.com/2026/c5a3089f-d40a-73ac-0c59-e08eb9094643.htm

---

| Rebar Bend Data Termination Rotation Angle 1 Property |
| --- |

Identifies he termination's rotation angle (in radians) at the end.
 The default value is 0\.0
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double TerminationRotationAngle1 { get; set; }
```

```
Public Property TerminationRotationAngle1 As Double
	Get
	Set
```

```
public:
property double TerminationRotationAngle1 {
	double get ();
	void set (double value);
}
```

```
member TerminationRotationAngle1 : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for terminationRotationAngle1 is not finite |

See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace